/* automatically generated by rust-bindgen */

pub type __uint8_t = ::std::os::raw::c_uchar;
pub type boolean = bool;
#[repr(C)]
pub struct AccelStepper__bindgen_vtable(::std::os::raw::c_void);
#[doc = ""]
#[doc = " \\class AccelStepper AccelStepper.h <AccelStepper.h>"]
#[doc = " \\brief Support for stepper motors with acceleration etc."]
#[doc = ""]
#[doc = " This defines a single 2 or 4 pin stepper motor, or stepper moter with fdriver chip, with optional"]
#[doc = " acceleration, deceleration, absolute positioning commands etc. Multiple"]
#[doc = " simultaneous steppers are supported, all moving"]
#[doc = " at different speeds and accelerations."]
#[doc = ""]
#[doc = " \\par Operation"]
#[doc = " This module operates by computing a step time in microseconds. The step"]
#[doc = " time is recomputed after each step and after speed and acceleration"]
#[doc = " parameters are changed by the caller. The time of each step is recorded in"]
#[doc = " microseconds. The run() function steps the motor once if a new step is due."]
#[doc = " The run() function must be called frequently until the motor is in the"]
#[doc = " desired position, after which time run() will do nothing."]
#[doc = ""]
#[doc = " \\par Positioning"]
#[doc = " Positions are specified by a signed long integer. At"]
#[doc = " construction time, the current position of the motor is consider to be 0. Positive"]
#[doc = " positions are clockwise from the initial position; negative positions are"]

    pub _acceleration: f32,
    pub _sqrt_twoa: f32,
    #[doc = " The current interval between steps in microseconds."]
    #[doc = " 0 means the motor is currently stopped with _speed == 0"]
    pub _stepInterval: ::std::os::raw::c_ulong,
    #[doc = " The last step time in microseconds"]
    pub _lastStepTime: ::std::os::raw::c_ulong,
    #[doc = " The minimum allowed pulse width in microseconds"]
    pub _minPulseWidth: ::std::os::raw::c_uint,
    #[doc = " Is the enable pin inverted?"]
    pub _enableInverted: bool,
    #[doc = " Enable pin for stepper driver, or 0xFF if unused."]
    pub _enablePin: u8,
    #[doc = " The pointer to a forward-step procedure"]
    pub _forward: ::std::option::Option<unsafe extern "C" fn()>,
    #[doc = " The pointer to a backward-step procedure"]
    pub _backward: ::std::option::Option<unsafe extern "C" fn()>,
    #[doc = " The step counter for speed calculations"]
    pub _n: ::std::os::raw::c_long,
    #[doc = " Initial step size in microseconds"]
    pub _c0: f32,
    #[doc = " Last step size in microseconds"]
    pub _cn: f32,
    #[doc = " Min step size in microseconds based on maxSpeed"]
    pub _cmin: f32,
}
#[doc = "< Use the functional interface, implementing your own driver functions (internal use only)"]
pub const AccelStepper_MotorInterfaceType_FUNCTION: AccelStepper_MotorInterfaceType = 0;
#[doc = "< Stepper Driver, 2 driver pins required"]
pub const AccelStepper_MotorInterfaceType_DRIVER: AccelStepper_MotorInterfaceType = 1;
#[doc = "< 2 wire stepper, 2 motor pins required"]
pub const AccelStepper_MotorInterfaceType_FULL2WIRE: AccelStepper_MotorInterfaceType = 2;
#[doc = "< 3 wire stepper, such as HDD spindle, 3 motor pins required"]
pub const AccelStepper_MotorInterfaceType_FULL3WIRE: AccelStepper_MotorInterfaceType = 3;
#[doc = "< 4 wire full stepper, 4 motor pins required"]
pub const AccelStepper_MotorInterfaceType_FULL4WIRE: AccelStepper_MotorInterfaceType = 4;
#[doc = "< 3 wire half stepper, such as HDD spindle, 3 motor pins required"]
pub const AccelStepper_MotorInterfaceType_HALF3WIRE: AccelStepper_MotorInterfaceType = 6;
#[doc = "< 4 wire half stepper, 4 motor pins required"]
pub const AccelStepper_MotorInterfaceType_HALF4WIRE: AccelStepper_MotorInterfaceType = 8;
#[doc = " \\brief Symbolic names for number of pins."]
#[doc = " Use this in the pins argument the AccelStepper constructor to"]
#[doc = " provide a symbolic name for the number of pins"]
#[doc = " to use."]
pub type AccelStepper_MotorInterfaceType = u32;
#[doc = "< Counter-Clockwise"]
pub const AccelStepper_Direction_DIRECTION_CCW: AccelStepper_Direction = 0;
#[doc = "< Clockwise"]
pub const AccelStepper_Direction_DIRECTION_CW: AccelStepper_Direction = 1;
#[doc = " \\brief Direction indicator"]
#[doc = " Symbolic names for the direction the motor is turning"]
pub type AccelStepper_Direction = u32;
#[test]
fn bindgen_test_layout_AccelStepper() {
    assert_eq!(
        ::std::mem::size_of::<AccelStepper>(),
        120usize,
        concat!("Size of: ", stringify!(AccelStepper))
    );
    assert_eq!(
        ::std::mem::align_of::<AccelStepper>(),
        8usize,
        concat!("Alignment of ", stringify!(AccelStepper))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._direction as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_direction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._interface as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._pin as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_pin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._pinInverted as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_pinInverted)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._currentPos as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_currentPos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._targetPos as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_targetPos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._speed as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_speed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._maxSpeed as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_maxSpeed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._acceleration as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_acceleration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._sqrt_twoa as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_sqrt_twoa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._stepInterval as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_stepInterval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._lastStepTime as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_lastStepTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._minPulseWidth as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_minPulseWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._enableInverted as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_enableInverted)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._enablePin as *const _ as usize },
        77usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_enablePin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._forward as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_forward)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._backward as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_backward)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._n as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._c0 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_c0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._cn as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_cn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AccelStepper>()))._cmin as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(AccelStepper),
            "::",
            stringify!(_cmin)
        )
    );
}
extern "C" {
    #[doc = " Set the target position. The run() function will try to move the motor (at most one step per call)"]
    #[doc = " from the current position to the target position set by the most"]
    #[doc = " recent call to this function. Caution: moveTo() also recalculates the speed for the next step."]
    #[doc = " If you are trying to use constant speed movements, you should call setSpeed() after calling moveTo()."]
    #[doc = " \\param[in] absolute The desired absolute position. Negative is"]
    #[doc = " anticlockwise from the 0 position."]
    #[link_name = "\u{1}_ZN12AccelStepper6moveToEl"]
    pub fn AccelStepper_moveTo(this: *mut AccelStepper, absolute: ::std::os::raw::c_long);
}
extern "C" {
    #[doc = " Set the target position relative to the current position"]
